app/Http/ViewComposers/WilayaComposer.php

select * from `wilayas`
---
    public function __construct()
    {
        $this->wilayas=Wilaya::all();