app/Repositories/Ads/AdsRepository.php

select * from `currencies` where `currencies`.`id` in (1)
select * from `images` where `images`.`ad_id` in (1, 2, 3)
select * from `wilayas` where `wilayas`.`id` in (1)
---
    public function all()
    {

        //$ads = \Cache::remember('ads','1440', function() {
            return $this->ads::with('images')->select('*')
           ->withCount('favorite')->withCount('Adview')
           ->with('wilaya')
           ->with('currency')
           ->paginate(32);

select * from `categories` where `categories`.`id` in (1)
---
    public function getByCategory($catId)
    {
        return $this->ads::with('images','category')->where('category_id',$catId)-> paginate(32);

select * from `images` where `images`.`ad_id` in (1, 2, 3)
---
    public function getCommonAds()
    {
        //return \Auth::user()->favAds;
        return $this->ads::with('images')->select('id','title','slug','price')->whereIn('id',
        Favorite::select('ad_id')
            ->groupBy('ad_id')
            ->orderByRaw('COUNT(*) DESC')
            ->limit(8)->get()
        ) ->paginate(32);;