app/Repositories/Posts/PostRepository.php

    public function storeImags($post,$imgArry)
    {
        foreach($imgArry as $img)
        {
           $img_name=$this->saveImages($img);

           $postimage=new postImage();
           $postimage->image = $img_name;
           $post->postImages()->save($postimage);
---
insert into `post_images` (`image`, `post_id`, `updated_at`, `created_at`) values ('1585123292-Crop-Rotation.jpg', 4, '2020-03-25 08:01:32', '2020-03-25 08:01:32')

    public function getById($id)
    {
        return $this->post::with('postImages')
        ->withCount('postfav')
        ->withCount('PostView')
        ->with('user')
        ->find($id);
---
select * from `post_images` where `post_images`.`post_id` in (4)
select * from `users` where `users`.`id` in (2)