app/Http/Controllers/PostController.php

    public function index()
    {
        $posts=Post::latest()->with('postImages')->withCount('postfav')->with('user')->withCount('PostView')->paginate(5);
---
select * from `post_images` where `post_images`.`post_id` in (2)
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `posts`

    public function show($id)
    {
        //$post=Post::find($id);
        $post=$this->post->getById($id);
        $archives=$this->getArchives();
       // $post->getViewsCount();
      // return  dd ($frr);

        //postsView::create(['viewable_type' => \DB::raw('viewable_type + 1'),'viewable_id' =>$id ]);

        $postview=new PostView();
        $postview->post_id=$id;
        $post->PostView()->save($postview);
---
insert into `post_views` (`post_id`, `updated_at`, `created_at`) values (4, '2020-03-25 08:02:55', '2020-03-25 08:02:55')

    public function archive($year,$month)
    {
        $posts=Post::whereYear('created_at',$year)->whereMonth('created_at',$month)->paginate(5);
---
select * from `posts` where year(`created_at`) = '2020' and month(`created_at`) = '4' limit 5 offset 0
select count(*) as aggregate from `posts` where year(`created_at`) = '2020' and month(`created_at`) = '4'

    private function getArchives()
    {
      //setlocale(LC_ALL, 'ar_DZ');
        return Post::selectRaw('MONTHNAME(created_at) month,MONTH(created_at) month_number,
        YEAR(created_at) year,COUNT(*) posts_count')
        ->groupBy('month','month_number','year')
        ->orderBy('created_at')
        ->get();
---
select MONTHNAME(created_at) month,MONTH(created_at) month_number,
YEAR(created_at) year,COUNT(*) posts_count from `posts` group by `month`, `month_number`, `year` order by `created_at` asc