app/Repositories/PostFavs/PostFavRepository.php

select `posts`.*, `post_favs`.`user_id` as `pivot_user_id`, `post_favs`.`post_id` as `pivot_post_id`, `post_favs`.`created_at` as `pivot_created_at`, `post_favs`.`updated_at` as `pivot_updated_at` from `posts` inner join `post_favs` on `posts`.`id` = `post_favs`.`post_id` where `post_favs`.`user_id` = 2 and `post_id` = '4' limit 1
---
    public function show($id)
    {
            $favoritedPost= \Auth::user()->post_favs()->wherePost_id($id)->first();